DS2002 - Project 1

Import dependencies

In [1]:
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine
import pymysql
import mysql.connector
import matplotlib.pyplot as plt
import json
import datetime
import certifi
import pymongo
import sqlalchemy

Declare connection variables

Code from Labs 2 and 3

In [2]:
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

define getting and setting data

In [3]:
def get_dataframe(user_id, pwd, host_name, src_dbname, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{src_dbname}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, dst_dbname, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{dst_dbname}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=sqlEngine, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=sqlEngine, index=False, if_exists='append')
    
    connection.close()

create connection and sakila_dw

In [4]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

get data from mySQL and perform transformations

In [5]:
sql_rental = "SELECT * FROM sakila.rental;"
df_rental = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 16:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 16:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 16:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 16:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 16:30:53

In [6]:
drop_cols = ['last_update', 'return_date']
df_rental.drop(drop_cols, axis=1, inplace=True)

df_rental.head()

   rental_id         rental_date  inventory_id  customer_id  staff_id
0          1 2005-05-24 22:53:30           367          130         1
1          2 2005-05-24 22:54:33          1525          459         1
2          3 2005-05-24 23:03:39          1711          408         1
3          4 2005-05-24 23:04:41          2452          333         2
4          5 2005-05-24 23:05:21          2079          222         1

In [7]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)
df_payment.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 17:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 17:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 17:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 17:12:30

In [8]:
drop_cols = ['last_update', 'staff_id', 'customer_id']
df_payment.drop(drop_cols, axis=1, inplace=True)

df_payment.head()

   payment_id  rental_id  amount        payment_date
0           1         76    2.99 2005-05-25 11:30:37
1           2        573    0.99 2005-05-28 10:35:23
2           3       1185    5.99 2005-06-15 00:54:12
3           4       1422    0.99 2005-06-15 18:02:53
4           5       1476    9.99 2005-06-15 21:08:46

In [9]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)
df_inventory.head()

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 00:09:17
1             2        1         1 2006-02-15 00:09:17
2             3        1         1 2006-02-15 00:09:17
3             4        1         1 2006-02-15 00:09:17
4             5        1         2 2006-02-15 00:09:17

In [10]:
drop_cols = ['last_update']
df_inventory.drop(drop_cols, axis=1, inplace=True)

df_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

Create fact table merging rental, inventory, and payment

In [11]:
df_fact_table = pd.merge (df_rental, df_inventory, on='inventory_id', how='inner')
df_fact_table.head()

,rental_id,rental_date,inventory_id,customer_id,staff_id,film_id,store_id
0,1,2005-05-24 22:53:30,367,130,1,80,1
1,1577,2005-06-16 04:03:28,367,327,2,80,1
2,3584,2005-07-06 04:16:43,367,207,1,80,1
3,10507,2005-08-01 11:22:20,367,45,2,80,1
4,13641,2005-08-20 07:34:42,367,281,1,80,1

In [12]:
df_fact_table = pd.merge(df_fact_table, df_payment, on='rental_id', how = 'inner')
df_fact_table.head()

,rental_id,rental_date,inventory_id,customer_id,staff_id,film_id,store_id,payment_id,amount,payment_date
0,1,2005-05-24 22:53:30,367,130,1,80,1,3504,2.99,2005-05-24 22:53:30
1,1577,2005-06-16 04:03:28,367,327,2,80,1,8828,3.99,2005-06-16 04:03:28
2,3584,2005-07-06 04:16:43,367,207,1,80,1,5603,2.99,2005-07-06 04:16:43
3,10507,2005-08-01 11:22:20,367,45,2,80,1,1244,2.99,2005-08-01 11:22:20
4,13641,2005-08-20 07:34:42,367,281,1,80,1,7623,2.99,2005-08-20 07:34:42

reorder the coloumns, grouping by id and date

In [13]:
columns = ['rental_id','inventory_id','customer_id','payment_id','film_id','store_id',
                   'payment_date','rental_date','amount']


df_fact_table = df_fact_table[columns]

df_fact_table.insert(0, "rental_key", range(1, df_fact_table.shape[0]+1))
df_fact_table.head()

,rental_key,rental_id,inventory_id,customer_id,payment_id,film_id,store_id,payment_date,rental_date,amount
0,1,1,367,130,3504,80,1,2005-05-24 22:53:30,2005-05-24 22:53:30,2.99
1,2,1577,367,327,8828,80,1,2005-06-16 04:03:28,2005-06-16 04:03:28,3.99
2,3,3584,367,207,5603,80,1,2005-07-06 04:16:43,2005-07-06 04:16:43,2.99
3,4,10507,367,45,1244,80,1,2005-08-01 11:22:20,2005-08-01 11:22:20,2.99
4,5,13641,367,281,7623,80,1,2005-08-20 07:34:42,2005-08-20 07:34:42,2.99

create dim date from lab 2 in sakila_dw and obtain date keys for each column

In [14]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head()

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02
2  20000103 2000-01-03
3  20000104 2000-01-04
4  20000105 2000-01-05

In [15]:
df_dim_payment_date = df_dim_date.rename(columns={"date_key" : "payment_date_key", "full_date" : "payment_date"})
df_fact_table = pd.merge(df_fact_table, df_dim_payment_date, on='payment_date', how='left')
df_fact_table.drop(['payment_date'], axis=1, inplace=True)
df_fact_table.head()

,rental_key,rental_id,inventory_id,customer_id,payment_id,film_id,store_id,rental_date,amount,payment_date_key
0,1,1,367,130,3504,80,1,2005-05-24 22:53:30,2.99,NaN
1,2,1577,367,327,8828,80,1,2005-06-16 04:03:28,3.99,NaN
2,3,3584,367,207,5603,80,1,2005-07-06 04:16:43,2.99,NaN
3,4,10507,367,45,1244,80,1,2005-08-01 11:22:20,2.99,NaN
4,5,13641,367,281,7623,80,1,2005-08-20 07:34:42,2.99,NaN

In [16]:
df_dim_rental_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
df_fact_table = pd.merge(df_fact_table, df_dim_rental_date, on='rental_date', how='left')
df_fact_table.drop(['rental_date'], axis=1, inplace=True)
df_fact_table.head()

,rental_key,rental_id,inventory_id,customer_id,payment_id,film_id,store_id,amount,payment_date_key,rental_date_key
0,1,1,367,130,3504,80,1,2.99,NaN,NaN
1,2,1577,367,327,8828,80,1,3.99,NaN,NaN
2,3,3584,367,207,5603,80,1,2.99,NaN,NaN
3,4,10507,367,45,1244,80,1,2.99,NaN,NaN
4,5,13641,367,281,7623,80,1,2.99,NaN,NaN

add fact table to sakila_dw

In [17]:
table_name = "fact_table_final"
primary_key = "rental_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_table, table_name, primary_key, db_operation)

validate creation

In [18]:
sql_fact_table_final = "SELECT * FROM sakila_dw.fact_table_final;"
df_fact_table_final = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_fact_table_final)
df_fact_table_final.head()

,rental_key,rental_id,inventory_id,customer_id,payment_id,film_id,store_id,amount,payment_date_key,rental_date_key
0,1,1,367,130,3504,80,1,2.99,NaN,NaN
1,2,1577,367,327,8828,80,1,3.99,NaN,NaN
2,3,3584,367,207,5603,80,1,2.99,NaN,NaN
3,4,10507,367,45,1244,80,1,2.99,NaN,NaN
4,5,13641,367,281,7623,80,1,2.99,NaN,NaN

export sakila_film as CSV file and read it in

In [20]:
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'sakila_film.csv')

df_film = pd.read_csv(data_file)
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,0,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 00:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,0,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 00:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,0,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 00:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,0,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 00:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,0,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 00:03:42

transform data

In [21]:
df_film.rename(columns={'film_id':'film_key'}, inplace=True)
df_film.drop(['last_update', 'original_language_id'], axis=1, inplace=True)

df_film.head()

,film_key,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

load data into sakila_dw

In [22]:
db_operation = "insert"
table = [('dim_film', df_film, 'film_key')]

In [23]:
for table_name, dataframe, primary_key in table:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

validate data is there

In [24]:
sql_dim_inventory = "SELECT * FROM sakila_dw.dim_film;"
df_dim_inventory = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_dim_inventory)
df_dim_inventory.head()

,film_key,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

Code from Lab 4
declare variables for mongoDB

In [26]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_hostname = "localhost"

atlas_cluster_name = "sandbox.0bvk6vz"
atlas_user_name = "apw9r"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net?retryWrites=true&w=majority&appName=Cluster0"
}


src_dbname = "sakila_dw"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://apw9r:Passw0rd123@sandbox.0bvk6vz.mongodb.net?retryWrites=true&w=majority&appName=Cluster0

define functions for getting and setting data

In [27]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn)
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(sqlalchemy.text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

read in json files to mongoDB

In [28]:
client = pymongo.MongoClient(conn_str["atlas"], tlsCAFile=certifi.where())
db = client[src_dbname]

data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"address" : 'sakila_address.json',
              "customer" : 'sakila_customer.json',
              "city" : 'sakila_city.json',
              "store" : 'sakila_store.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

transform address, customer, city, and store data

In [29]:
query = {}
collection = "address"

df_address = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_address.head()

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,,Alberta,300,,,"{'type': 'Point', 'coordinates': [-112.8185647...",2014-09-25 18:30:27
1,2,28 MySQL Boulevard,,QLD,576,,,"{'type': 'Point', 'coordinates': [153.1408538,...",2014-09-25 18:30:09
2,3,23 Workhaven Lane,,Alberta,300,,14033335568,"{'type': 'Point', 'coordinates': [-112.8185673...",2014-09-25 18:30:27
3,4,1411 Lillydale Drive,,QLD,576,,6172235589,"{'type': 'Point', 'coordinates': [153.1913094,...",2014-09-25 18:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,"{'type': 'Point', 'coordinates': [129.7227851,...",2014-09-25 18:31:53

In [30]:
drop_cols = ['last_update', 'location', 'phone','address2']
df_address.drop(drop_cols, axis=1, inplace=True)
df_address.rename(columns={"address_id":"address_key"}, inplace=True)
df_address.head()

   address_key               address  district  city_id postal_code
0            1     47 MySakila Drive   Alberta      300
1            2    28 MySQL Boulevard       QLD      576
2            3     23 Workhaven Lane   Alberta      300
3            4  1411 Lillydale Drive       QLD      576
4            5        1913 Hanoi Way  Nagasaki      463       35200

In [31]:
query = {}
collection = "customer"

df_customer = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_customer.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 23:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 23:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 23:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-14 23:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 23:57:20

In [32]:
drop_cols = ['last_update', 'create_date']
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace=True)
df_customer.head()

,customer_key,store_id,first_name,last_name,email,address_id,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1

In [33]:
query = {}
collection = "city"

df_city = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_city.head()

   city_id                  city  country_id          last_update
0        1  A Corua (La Corua)          87  2006-02-14 23:45:25
1        2                  Abha          82  2006-02-14 23:45:25
2        3             Abu Dhabi         101  2006-02-14 23:45:25
3        4                 Acua          60  2006-02-14 23:45:25
4        5                 Adana          97  2006-02-14 23:45:25

In [34]:
drop_cols = ['last_update']
df_city.drop(drop_cols, axis=1, inplace=True)
df_city.rename(columns={"city_id":"city_key"}, inplace=True)
df_city.head()

   city_key                  city  country_id
0         1  A Corua (La Corua)          87
1         2                  Abha          82
2         3             Abu Dhabi         101
3         4                 Acua          60
4         5                 Adana          97

In [35]:
query = {}
collection = "store"

df_store = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_store.head()

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-14 23:57:12
1         2                 2           2  2006-02-14 23:57:12

In [36]:
drop_cols = ['last_update']
df_store.drop(drop_cols, axis=1, inplace=True)
df_store.rename(columns={"store_id":"store_key"}, inplace=True)
df_store.head()

   store_key  manager_staff_id  address_id
0          1                 1           1
1          2                 2           2

load dim tables back into sakila_dw and show they were added

In [38]:
dataframe = df_customer
table_name = 'dim_customer'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [41]:
sql_customer = "SELECT * FROM sakila_dw.dim_customer;"
df_dim_customer = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_customer )
df_dim_customer.head()

,customer_key,store_id,first_name,last_name,email,address_id,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1

In [42]:
dataframe = df_address
table_name = 'dim_address'
primary_key = 'address_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [43]:
sql_address = "SELECT * FROM sakila_dw.dim_address;"
df_dim_address = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_address)
df_dim_address.head()

   address_key               address  district  city_id postal_code
0            1     47 MySakila Drive   Alberta      300
1            2    28 MySQL Boulevard       QLD      576
2            3     23 Workhaven Lane   Alberta      300
3            4  1411 Lillydale Drive       QLD      576
4            5        1913 Hanoi Way  Nagasaki      463       35200

In [44]:
dataframe = df_city
table_name = 'dim_city'
primary_key = 'city_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [46]:
sql_city = "SELECT * FROM sakila_dw.dim_city;"
df_dim_city = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_city)
df_dim_city.head()

   city_key                  city  country_id
0         1  A Corua (La Corua)          87
1         2                  Abha          82
2         3             Abu Dhabi         101
3         4                 Acua          60
4         5                 Adana          97

In [47]:
dataframe = df_store
table_name = 'dim_store'
primary_key = 'store_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [48]:
sql_store = "SELECT * FROM sakila_dw.dim_store;"
df_dim_store = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_store)
df_dim_store.head()

   store_key  manager_staff_id  address_id
0          1                 1           1
1          2                 2           2

author SQL Query to show sakila_dw exists

In [51]:
sql_test = """
    SELECT 
    dim_film.title,
    dim_customer.last_name,
    SUM(fact_table_final.amount) as total_payment
FROM fact_table_final
INNER JOIN dim_customer ON fact_table_final.customer_id = dim_customer.customer_key
INNER JOIN dim_film ON fact_table_final.film_id = dim_film.film_key
GROUP BY dim_customer.last_name, dim_film.title;
""".format(dst_dbname)

df_test = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_test)
df_test.head()

             title last_name  total_payment
0  BLANKET BEVERLY    HUNTER           2.99
1  BLANKET BEVERLY  THRASHER           3.99
2  BLANKET BEVERLY  CASTILLO           2.99
3  BLANKET BEVERLY  PHILLIPS           2.99
4  BLANKET BEVERLY    OBRIEN           2.99